renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx72n/r_mmcif_dev.c
    return MMC_SUCCESS;
}


/**********************************************************************************************************************
* Outline      : Write to MMC
* Function Name: r_mmcif_dev_write_data
* Description  : Writes the sector data in the data register. 
* Arguments    : uint8_t            *p_buff             ;   Write data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_write_data(uint8_t *p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t *p_reg = (uint32_t *)(reg_addr);
    uint32_t *p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;

    /* Revised, num++ -> num+=3 because the argument num may be set to 1, */
    /*          and num/4 value must be greater than 0.                   */ 
    num = num + 3;
    num = num / 4;
    if ((uint32_t)p_buff & 0x3)
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
#if (MMC_BIG_ENDIAN)
            tmp =  (uint32_t)(*p_buff++ << 24);
            tmp |= (uint32_t)(*p_buff++ << 16);
            tmp |= (uint32_t)(*p_buff++ << 8);
            tmp |= (uint32_t)(*p_buff++);
            *p_reg = tmp;
#else
            tmp =  (uint32_t)(*p_buff++);
            tmp |= (uint32_t)(*p_buff++ << 8);
            tmp |= (uint32_t)(*p_buff++ << 16);
            tmp |= (uint32_t)(*p_buff++ << 24);
            *p_reg = tmp;
#endif
        }
    }
    else
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
            *p_reg = *p_ptr++;
        }
    }

    return MMC_SUCCESS;

}


/**********************************************************************************************************************
* Outline      : Get Clock Dividing Ratio
* Function Name: r_mmcif_dev_get_clockdiv
* Description  : Gets Clock dividing ratio.
* Arguments    : int32_t            clock               ;   Clock frequency
* Return Value : uint32_t                               ;   Clock dividing ratio
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_mmcif_dev_get_clockdiv(int32_t clock)
{
    uint32_t div = 0;

    switch(clock)
    {
        case MMC_CLK_52MHz:
            div = MMC_CFG_DIV_HIGH_SPEED;
        break;
        case MMC_CLK_26MHz:
        case MMC_CLK_20MHz:
            /* 26MHz 20MHz It contains. */
            div = MMC_CFG_DIV_BACKWARD_COM_SPEED;
        break;
        case MMC_CLK_10MHz:
        case MMC_CLK_5MHz:
        case MMC_CLK_1MHz:
        case MMC_CLK_400kHz:
            /* 10MHz 5MHz 1MHz 400kHz It contains. */
            div = MMC_CFG_DIV_INIT_SPEED;
        break;
        default:
            div = MMC_CFG_DIV_INIT_SPEED;
        break;
    }

    return div;
}


/**********************************************************************************************************************
* Outline      : Wait MMC Card Interrupt
* Function Name: r_mmcif_dev_int_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           channel             ;   MMC Channel No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : MMC_SUCCESS                            ;   Interrupt detection
*              : MMC_ERR                                ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_int_wait(uint32_t channel, uint32_t time)
{
    mmc_status_t ret = MMC_SUCCESS;

    if (r_mmcif_dev_start_timer(channel, time) == MMC_ERR)
    {
        return MMC_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (MMC_SUCCESS == r_mmcif_get_intstatus(channel))
        {
            ret = MMC_SUCCESS;
            break;
        }

        /* Timeout? */
        if (MMC_ERR == r_mmcif_dev_check_timer(channel))
        {
            ret = MMC_ERR;
            break;
        }
    }

    r_mmcif_dev_end_timer(channel);

    return ret;
}


/**********************************************************************************************************************
* Outline      : Wait
* Function Name: r_mmcif_dev_wait
* Description  : Starts timer and waits.
* Arguments    : uint32_t           channel             ;   MMC Channel No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_wait(uint32_t channel, uint32_t time)
{
    if (r_mmcif_dev_start_timer(channel, time) == MMC_ERR)
    {
        return MMC_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Timeout? */
        if (MMC_ERR == r_mmcif_dev_check_timer(channel))
        {
            break;
        }
    }

    r_mmcif_dev_end_timer(channel);

